"use client";

export default function Register() {
    return (
      <>
      <div className='w-full h-full bg-[#2D364E] text-white scroll-smooth'>
        <div className='flex justify-center'>
            <div className='w-full flex flex-col items-center justify-center font-bold text-5xl pt-16 pb-3 bg-[#212738]'>
            Privacy Policy <br />
            <span className='text-sm mt-5 opacity-40 justify-start'>Last updated: 26/01/2026</span>
            </div>
        </div>
        <div className="top-0 left-0 w-full overflow-hidden leading-[0]">
        <svg 
          data-name="Layer 1" 
          xmlns="http://www.w3.org/2000/svg" 
          viewBox="0 0 1200 120" 
          preserveAspectRatio="none"
          className="relative block h-[172px] w-[calc(300%+1.3px)]"
        >
          <path 
            d="M321.39,56.44c58-10.79,114.16-30.13,172-41.86,82.39-16.72,168.19-17.73,250.45-.39C823.78,31,906.67,72,985.66,92.83c70.05,18.48,146.53,26.09,214.34,3V0H0V27.35A600.21,600.21,0,0,0,321.39,56.44Z" 
            className="fill-[#212738]"
          />
        </svg>
        </div>
        
        {/* #212738 */}
        <div className='flex justify-around'>
          <nav className='font-bold max-h-80 overflow-y-auto p-10 pt-0 text-lg bg-[#212738] m-10 mt-0 mr-0 -pt-5 rounded-md self-start
          sticky top-10 w-1/4 max-h-[calc(60vh-5rem)] overflow-y-auto 
  
  [&::-webkit-scrollbar]:w-2
  [&::-webkit-scrollbar-track]:bg-[#212738]
  [&::-webkit-scrollbar-thumb]:bg-gray-500
  [&::-webkit-scrollbar-thumb]:rounded-full
  '>
              <p className="sticky bg-[#212738] pt-5 pb-4 top-0">Navigation</p>
              <br />
              <ul className='mt-3 text-sm/7 [&_li]:hover:bg-[#181d29] [&_li]:pl-5 [&_li]:rounded-md [&_li]:mb-1'>
                  <a href="#p1"><li>p1</li></a>
                  <a href="#p2"><li>p2</li></a>
                  <a href="#p3"><li>p3</li></a>
                  <a href="#p4"><li>p4</li></a>
                  <a href="#p5"><li>p5</li></a>
                  <a href="#p6"><li>p6</li></a>
                  <a href="#p7"><li>p7</li></a>
                  <a href="#p8"><li>p8</li></a>
                  <a href="#p9"><li>p9</li></a>
                  <a href="#p10"><li>p10</li></a>
                  <a href="#p11"><li>p11</li></a>
                  <a href="#p12"><li>p12</li></a>
                  <a href="#p13"><li>p13</li></a>
                  
              </ul>
          </nav>
          <div className='[&_section]:scroll-mt-16 [&_span]:text-xl/12 [&_span]:font-bold [&_span]:-ml-6 [&_span]:inline-block [&_span]:indent-0
           [&_ul]:list-disc [&_ul]:list-inside [&_ul]:ml-4 [&_p]:ml-2 px-8 text-base/8 pb-10 indent-8 scroll-smooth'>
            <section id="p1">
              <span>1. นโยบายความเป็นส่วนตัว</span><br />
                <p>โครงการฝึกอบรมเชิงปฏิบัติการคอมพิวเตอร์ ครั้งที่ 36 ให้ความสําคัญกับการคุ้มครองข้อมูลส่วนบุคคลของคุณ
              โดยนโยบายความเป็นส่วนตัวฉบับนี้ได้อธิบายแนวปฏิบัติเกี่ยวกับการเก็บรวบรวม ใช้ หรือ เปิดเผยข้อมูลส่วนบุคคลรวมถึงสิทธิต่าง ๆ
              ของเจ้าของข้อมูลส่วนบุคคล ตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล</p>
            </section>
            <br />
            <section id="p2">
              <span>2. การเก็บรวบรวมข้อมูลส่วนบุคคล</span><br />
              <p>เราจะเก็บข้อมูลส่วนบุคคลที่ได้รับโดยตรงจากคุณผ่านช่องทาง ดังต่อไปนี้</p>
              <ul>
                <li>การรับสมัครเข้าร่วมโครงการ</li>
              </ul>
            </section>
            <br />
            <section id="p3">
              <span>3. ประเภทข้อมูลส่วนบุคคลที่เก็บรวบรวม</span><br />
                <ul>
                  <li><strong>ข้อมูลส่วนบุคคล</strong> เช่น ชื่อ นามสกุล อายุ วัน/เดือน/ปีเกิด สัญชาติ เลขประจำตัวประชาชน เป็นต้น</li>
                  <li><strong>ข้อมูลการติดต่อ</strong> เช่น ที่อยู่ หมายเลขโทรศัพท์ อีเมล เป็นต้น</li>
                  <li><strong>ข้อมูลบัญชี</strong> เช่น บัญชีผู้ใช้งาน ประวัติการใช้งาน เป็นต้น</li>
                  <li><strong>หลักฐานแสดงตัวตน</strong> เช่น สำเนาบัตรประจำตัวประชาชน เอกสารรับรองการเป็นนักเรียน เป็นต้น</li>
                  <li><strong>ข้อมูลอื่นๆ</strong> เช่น รูปภาพและข้อมูลอื่นใดที่ถือว่าเป็นข้อมูลส่วนบุคคลตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลอ่อนไหว ดังต่อไปนี้ เมื่อเราได้รับความยินยอมโดยชัดแจ้งจากคุณ เว้นแต่กฎหมายกำหนดให้ทำได้</li>
                  <li><strong>ข้อมูลสุขภาพ</strong></li>
                  
                </ul>
            </section>
            <br />
            <section id="p4">
              <span>4. ผู้เยาว์</span><br />
              <p>หากคุณมีอายุต่ำกว่า 20 ปีหรือมีข้อจํากัดความสามารถตามกฎหมาย เราอาจเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณ เราอาจจําเป็นต้องให้พ่อแม่หรือผู้ปกครองของคุณให้ความยินยอมหรือที่กฎหมายอนุญาตให้ทําได้ หากเราทราบว่ามีการเก็บรวบรวมข้อมูลส่วนบุคคลจากผู้เยาว์โดยไม่ได้รับความยินยอมจากพ่อแม่หรือผู้ปกครอง เราจะดําเนินการลบข้อมูลนั้นออกจากฐานข้อมูลของเรา</p>
            </section>
            <br />
            <section id="p5">
              <span>5. วิธีการเก็บรักษาข้อมูลส่วนบุคคล</span><br />
              <p>เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณในรูปแบบเอกสารและรูปแบบอิเล็กทรอนิกส์</p>
            </section>
            <br />
            <section id="p6">
              <span>6. การประมวลผลข้อมูลส่วนบุคคล</span><br />
              <p>เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณเพื่อวัตถุประสงค์ดังต่อไปนี้</p>
              <ul>
                <li>เพื่อยืนยันว่าผู้สมัครมีตัวตนจริง</li>
                <li>เพื่อใช้ประกอบการพิจารณาคุณสมบัติของผู้สมัครตามที่โครงการกำหนด</li>
                <li>เพื่อปฏิบัติตามกฎหมายและกฎระเบียบของหน่วยงานราชการ</li>
              </ul>
            </section>
            <br />
            <section id="p7">
              <span>7. การเปิดเผยข้อมูลส่วนบุคคล</span><br />
              <p>เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณเท่าที่จำเป็นให้เจ้าหน้าที่ภายในโครงการภายใต้ความยินยอมของคุณหรือที่กฎหมายอนุญาตให้เปิดเผยได้ เพื่อการบริหารจัดการโครงการอย่างมีประสิทธิภาพ</p>
            </section>
            <br />
            <section id="p8">
              <span>8. ระยะเวลาจัดเก็บข้อมูลส่วนบุคคล</span><br />
              <p>เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณไว้ตามระยะเวลาที่จําเป็นสำหรับการบรรลุวัตถุประสงค์ตามนโยบายนี้ ซึ่งอาจจําเป็นต้องเก็บรักษาไว้ต่อไปภายหลังจากนั้น หากมีกฎหมายกําหนดไว้เราจะลบ ทําลาย หรือทําให้เป็นข้อมูลที่ไม่สามารถระบุตัวตนของคุณได้ เมื่อหมดความจําเป็นหรือสิ้นสุดระยะเวลาดังกล่าว</p>
            </section>
            <br />
            <section id="p9">
              <span>9. สิทธิของเจ้าของข้อมูลส่วนบุคคล</span><br />
              <p>ภายใต้กฎหมายคุ้มครองข้อมูลส่วนบุคคล คุณมีสิทธิในการดำเนินการดังต่อไปนี้</p>
              <ul>
                <li>สิทธิขอถอนความยินยอม (Right to withdraw consent) หากคุณได้ให้ความยินยอม เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณ ไม่ว่าจะเป็นความยินยอมที่คุณให้ไว้ก่อนวันที่กฎหมายคุ้มครองข้อมูลส่วนบุคคลใช้บังคับหรือหลังจากนั้น คุณมีสิทธิที่จะถอนความยินยอมเมื่อใดก็ได้ตลอดเวลา</li>
                <li>สิทธิขอเข้าถึงข้อมูล (Right to access) คุณมีสิทธิขอเข้าถึงข้อมูลส่วนบุคคลของคุณที่อยู่ในความรับผิดชอบของเราและขอให้เราทำสําเนาข้อมูลดังกล่าวให้แก่คุณ รวมถึงขอให้เราเปิดเผยว่าเราได้ข้อมูลส่วนบุคคลของคุณมาได้อย่างไร</li>
                <li>สิทธิขอถ่ายโอนข้อมูล (Right to data portability) คุณมีสิทธิขอรับข้อมูลส่วนบุคคลของคุณในกรณีที่เราได้จัดทําข้อมูลส่วนบุคคลนั้นอยู่ในรูปแบบให้สามารถอ่านหรือใช้งานได้ด้วยเครื่องมือหรืออุปกรณ์ที่ทํางานได้โดยอัตโนมัติและสามารถใช้หรือเปิดเผยข้อมูลส่วนบุคคลได้ด้วยวิธีการอัตโนมัติ รวมทั้งมีสิทธิขอให้เราส่งหรือโอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นเมื่อสามารถทําได้ด้วยวิธีการอัตโนมัติ และมีสิทธิขอรับข้อมูลส่วนบุคคลที่เราส่งหรือ โอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นโดยตรง เว้นแต่ไม่สามารถดําเนินการได้เพราะเหตุทางเทคนิค</li>
                <li>สิทธิขอคัดค้าน (Right to object) คุณมีสิทธิขอคัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณในเวลาใดก็ได้ หากการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณที่ทําขึ้นเพื่อการดําเนินงานที่จําเป็นภายใต้ประโยชน์โดยชอบด้วยกฎหมายของเราหรือของบุคคลหรือนิติบุคคลอื่น โดยไม่เกินขอบเขตที่คุณสามารถคาดหมายได้อย่างสมเหตุสมผลหรือเพื่อดําเนินการตามภารกิจเพื่อสาธารณประโยชน์</li>
                <li>สิทธิขอให้ลบหรือทําลายข้อมูล (Right to erasure/destruction) คุณมีสิทธิขอลบหรือทําลายข้อมูลส่วนบุคคลของคุณหรือทําให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวคุณได้ หากคุณเชื่อว่าข้อมูลส่วนบุคคลของคุณถูกเก็บรวบรวม ใช้ หรือเปิดเผยโดยไม่ชอบด้วยกฎหมายที่เกี่ยวข้องหรือเห็นว่าเราหมดความจําเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์ที่เกี่ยวข้องในนโยบายฉบับนี้หรือเมื่อคุณได้ใช้สิทธิขอถอนความยินยอมหรือใช้สิทธิขอคัดค้านตามที่แจ้งไว้ข้างต้นแล้ว</li>
                <li>สิทธิขอให้ระงับการใช้ข้อมูล (Right to restriction of processing) คุณมีสิทธิขอให้ระงับการใช้ข้อมูลส่วนบุคคลชั่วคราวในกรณีที่เราอยู่ระหว่างตรวจสอบตามคําร้องขอใช้สิทธิขอแก้ไขข้อมูลส่วนบุคคลหรือขอคัดค้านของคุณหรือกรณีอื่นใดที่เราหมดความจําเป็นและต้องลบหรือทำลายข้อมูลส่วนบุคคลของคุณตามกฎหมายที่เกี่ยวข้องแต่คุณขอให้เราระงับการใช้แทน</li>
                <li>สิทธิขอให้แก้ไขข้อมูล (Right to rectification) คุณมีสิทธิขอแก้ไขข้อมูลส่วนบุคคลของคุณให้ถูกต้อง เป็นปัจจุบัน สมบูรณ์และ ไม่ก่อให้เกิดความเข้าใจผิด</li>
                <li>สิทธิร้องเรียน (Right to lodge a complaint) คุณมีสิทธิร้องเรียนต่อผู้มีอำนาจตามกฎหมายที่เกี่ยวข้อง หากคุณเชื่อว่าการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณเป็นการกระทำในลักษณะที่ฝ่าฝืนหรือไม่ปฏิบัติตามกฎหมายที่เกี่ยวข้อง</li>
              </ul>
            </section>
            <br />
            <section id="p10">
              <span>10. คุกกี้ที่เราใช้งาน</span><br />
              <p></p>
            </section>
            <br />
            <section id="p11">
              <span>11. การรักษาความมั่นคงและความปลอดภัยของข้อมูลส่วนบุคคล</span><br />
              <p></p>
            </section>
            <br />
            <section id="p12">
              <span>12. การแจ้งเหตุละเมิดข้อมูลส่วนบุคคล</span><br />
              <p></p>
            </section>
            <br />
            <section id="p13">
              <span>13. รายละเอียดการติดต่อ</span><br />
              <p></p>
            </section>
          </div>
        </div>
      </div>
    </>
    );
}